docs/archive_formats.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>archive-formats</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org555b909">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org1c8c910" class="outline-2">
<h2 id="org1c8c910">archive/compression formats</h2>
<div class="outline-text-2" id="text-org1c8c910">
<p>
Putting things places for reasons!
</p>
<ul class="org-ul">
<li><a href="torrents.html#ID-897075c7-1826-4e0d-bd35-fe1ce8e1ecd0">torrents</a></li>
<li><a href="usenet.html#ID-8a060a9e-3694-40bf-b9ad-a4c4a9e46507">usenet</a></li>
<li>shar
<ul class="org-ul">
<li>self extracting shell archive script</li>
</ul></li>
<li>nar
<ul class="org-ul">
<li>normalized archive used by guix. Comparable to tar.</li>
</ul></li>
<li>zip
<ul class="org-ul">
<li>ignores invalid data in zipfile (how <a href="https://justine.lol/ape.html">APE executables</a> work)</li>
<li>contains directory structure</li>
<li>supports compression</li>
</ul></li>
<li><a href="rar.html#ID-308edd9a-90d8-44f3-ab1f-fae4942b0eae">rar</a></li>
<li>Apache Parquet format
<ul class="org-ul">
<li>column page store for large datasets with metadata searching</li>
<li>Apache Arrow supports operations like querying/reading/writing</li>
</ul></li>
<li>web archive (warc with pywb)</li>
<li>zstd can create 'dictionaries' with the <code>-D</code> option that can greatly help when compressing small files.</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell" id="orgc97dc72">pip install --user pywb
wb-manager init my-web-archive
wget --recursive --warc mywarcfile https://mysite
wb-manager add my-web-archive &lt;path/to/my_warc.warc.gz&gt;
wayback # http://localhost:8080/my-web-archive/&lt;url&gt;/
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
